---
type: Noise
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 13
tags: [revit-api, class]
---

# Noise

`Autodesk.Revit.DB.Visual.Noise` · Revit 2024 · 13 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | NoiseColor1 | 2018.1 | `public static string NoiseColor1 { get ; }` |
| Property | NoiseColor2 | 2018.1 | `public static string NoiseColor2 { get ; }` |
| Property | NoiseLevels | 2018.1 | `public static string NoiseLevels { get ; }` |
| Property | NoisePhase | 2018.1 | `public static string NoisePhase { get ; }` |
| Property | NoiseSize | 2018.1 | `public static string NoiseSize { get ; }` |
| Property | NoiseThresholdHigh | 2018.1 | `public static string NoiseThresholdHigh { get ; }` |
| Property | NoiseThresholdLow | 2018.1 | `public static string NoiseThresholdLow { get ; }` |
| Property | NoiseType | 2018.1 | `public static string NoiseType { get ; }` |
| Property | TextureAngle | 2018.1 | `public static string TextureAngle { get ; }` |
| Property | TextureLinkTextureTransforms | 2018.1 | `public static string TextureLinkTextureTransforms { get ; }` |
| Property | TextureRealWorldOffsetX | 2018.1 | `public static string TextureRealWorldOffsetX { get ; }` |
| Property | TextureRealWorldOffsetY | 2018.1 | `public static string TextureRealWorldOffsetY { get ; }` |
| Property | TextureRealWorldOffsetZ | 2018.1 | `public static string TextureRealWorldOffsetZ { get ; }` |